// baziData.ts
// 定义天干、地支、五行、十神等基础数据

/**
 * 天干
 */
export const Gan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

/**
 * 地支
 */
export const Zhi = [
  "子",
  "丑",
  "寅",
  "卯",
  "辰",
  "巳",
  "午",
  "未",
  "申",
  "酉",
  "戌",
  "亥",
];

/**
 * 天干五行
 */
export const gan5 = {
  甲: "木",
  乙: "木",
  丙: "火",
  丁: "火",
  戊: "土",
  己: "土",
  庚: "金",
  辛: "金",
  壬: "水",
  癸: "水",
};

/**
 * 地支五行
 */
export const zhi5 = {
  子: "水",
  丑: "土",
  寅: "木",
  卯: "木",
  辰: "土",
  巳: "火",
  午: "火",
  未: "土",
  申: "金",
  酉: "金",
  戌: "土",
  亥: "水",
};

/**
 * 地支藏干
 * key: 地支
 * value: [本气, 中气, 余气]
 */
export const cangGan = {
  子: ["癸"],
  丑: ["己", "癸", "辛"],
  寅: "丙甲戊",
  卯: ["乙"],
  辰: ["戊", "乙", "癸"],
  巳: ["丙", "庚", "戊"],
  午: ["丁", "己"],
  未: ["己", "丁", "乙"],
  申: ["庚", "壬", "戊"],
  酉: ["辛"],
  戌: ["戊", "辛", "丁"],
  亥: ["壬", "甲"],
};

/**
 * 五行颜色
 */
export const fiveElementsColor = {
  金: "#D4AF37", // 土豪金
  木: "#26a69a", // 绿松石
  水: "#42a5f5", // 蓝色
  火: "#ef5350", // 红色
  土: "#D2B48C", // 亮棕色
};

/**
 * 十神表
 * [日元阴阳][日元五行][被作用天干五行]
 */
export const ten_deities: {
  [key in "阳" | "阴"]: { [key: string]: { [key: string]: string } };
} = {
  阳: {
    木: { 木: "比肩", 火: "食神", 土: "偏财", 金: "七杀", 水: "偏印" },
    火: { 木: "偏印", 火: "比肩", 土: "食神", 金: "偏财", 水: "七杀" },
    土: { 木: "七杀", 火: "偏印", 土: "比肩", 金: "食神", 水: "偏财" },
    金: { 木: "偏财", 火: "七杀", 土: "偏印", 金: "比肩", 水: "食神" },
    水: { 木: "食神", 火: "偏财", 土: "七杀", 金: "偏印", 水: "比肩" },
  },
  阴: {
    木: { 木: "劫财", 火: "伤官", 土: "正财", 金: "正官", 水: "正印" },
    火: { 木: "正印", 火: "劫财", 土: "伤官", 金: "正财", 水: "正官" },
    土: { 木: "正官", 火: "正印", 土: "劫财", 金: "伤官", 水: "正财" },
    金: { 木: "正财", 火: "正官", 土: "正印", 金: "劫财", 水: "伤官" },
    水: { 木: "伤官", 火: "正财", 土: "正官", 金: "正印", 水: "劫财" },
  },
};

/**
 * 纳音
 */
export const nayins: { [key: string]: string } = {
  甲子乙丑: "海中金",
  丙寅丁卯: "炉中火",
  戊辰己巳: "大林木",
  庚午辛未: "路旁土",
  壬申癸酉: "剑锋金",
  甲戌乙亥: "山头火",
  丙子丁丑: "涧下水",
  戊寅己卯: "城头土",
  庚辰辛巳: "白蜡金",
  壬午癸未: "杨柳木",
  甲申乙酉: "井泉水",
  丙戌丁亥: "屋上土",
  戊子己丑: "霹雳火",
  庚寅辛卯: "松柏木",
  壬辰癸巳: "长流水",
  甲午乙未: "沙中金",
  丙申丁酉: "山下火",
  戊戌己亥: "平地木",
  庚子辛丑: "壁上土",
  壬寅癸卯: "金箔金",
  甲辰乙巳: "覆灯火",
  丙午丁未: "天河水",
  戊申己酉: "大驿土",
  庚戌辛亥: "钗钏金",
  壬子癸丑: "桑柘木",
  甲寅乙卯: "大溪水",
  丙辰丁巳: "沙中土",
  戊午己未: "天上火",
  庚申辛酉: "石榴木",
  壬戌癸亥: "大海水",
};
